Documents/ПоказанияСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоказанияСчетчиков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТекущиеПоказания</xr:Item>
				<xr:Item>AccumulationRegister.ПотреблениеЭлектроэнергии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущееПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотреблениеКвт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СчетчикиВводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиВводов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеПоказания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеПоказания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиБоксов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиБоксов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Счетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Счетчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТрансформации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежповерочныйИнтервал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПоказанияСчетчиков/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоказания(Команда)
	Если Объект.Показания.Количество() > 0
		И Вопрос("Заполнить зановво? Введённые показания будут стёрты.",
		РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
	    Возврат;	
	КонецЕсли;
	ЗаполнитьПоказанияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказанияНаСервере()
	Объект.Показания.Очистить();
	Момент = Объект.Дата - 1;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Счетчики.Ссылка КАК Счетчик,
	|	ЕСТЬNULL(ТекущиеПоказанияСрезПоследних.Показание, 0) КАК Показание,
	|	ЕСТЬNULL(СчетчикиБоксовСрезПоследних.Бокс.Код, ЕСТЬNULL(СчетчикиВводовСрезПоследних.Ввод.Код, """")) КАК КодМеста,
	|	Счетчики.ТипСчетчика КАК ТипСчетчика
	|ИЗ
	|	РегистрСведений.СчетчикиВводов.СрезПоследних КАК СчетчикиВводовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Счетчики КАК Счетчики
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеПоказания.СрезПоследних(&Момент, ) КАК ТекущиеПоказанияСрезПоследних
	|			ПО (ТекущиеПоказанияСрезПоследних.Счетчик = Счетчики.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетчикиБоксов.СрезПоследних(&Момент, ) КАК СчетчикиБоксовСрезПоследних
	|			ПО (СчетчикиБоксовСрезПоследних.Счетчик = Счетчики.Ссылка)
	|		ПО СчетчикиВводовСрезПоследних.Счетчик = Счетчики.Ссылка
	|ГДЕ
	|	НЕ Счетчики.ПометкаУдаления
	|	И (СчетчикиБоксовСрезПоследних.Счетчик ЕСТЬ НЕ NULL 
	|			ИЛИ СчетчикиВводовСрезПоследних.Счетчик ЕСТЬ НЕ NULL )
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипСчетчика УБЫВ,
	|	КодМеста,
	|	Счетчики.Код";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = Объект.Показания.Добавить();
		Стр.Счетчик = Выборка.Счетчик;
		Стр.ПредыдущееПоказание = Выборка.Показание;
		Стр.Показание = Выборка.Показание;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Использование = Истина;

    // Где подсвечиваем: вся строка таблицы
    Поле = ЭлементОформления.Поля.Элементы.Добавить();
    Поле.Поле = Новый ПолеКомпоновкиДанных("Показания");

    // Когда подсвечиваем: Показание = ПредыдущееПоказание
    Условие = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Условие.Использование = Истина;
    Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Показания.Показание");
    Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    Условие.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Показания.ПредыдущееПоказание");

    // Как подсвечиваем: мягкий лимонный фон
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 250, 205));
КонецПроцедуры
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    // Спрашиваем только при проведении, не при простой записи
    Если НЕ ПараметрыЗаписи.Свойство("Проведение") Тогда
        Возврат;
    КонецЕсли;

    БезПоказаний = 0;
    Примеры = "";
    Для Каждого Стр Из Объект.Показания Цикл
        Если Стр.Счетчик.Пустая() Тогда
            Продолжить;
        КонецЕсли;
        Если Стр.Показание = Стр.ПредыдущееПоказание Тогда // те же строки, что подсвечены
            БезПоказаний = БезПоказаний + 1;
            Если БезПоказаний <= 3 Тогда
                Примеры = Примеры + ?(Примеры = "", "", ", ") + Строка(Стр.Счетчик);
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    Если БезПоказаний = 0 Тогда
        Возврат;
    КонецЕсли;

    ТекстВопроса = "По " + БезПоказаний + " счётчикам не введены новые показания"
        + " (потребление по ним будет нулевым)."
        + ?(Примеры = "", "", Символы.ПС + "Например: " + Примеры
            + ?(БезПоказаний > 3, " и др.", "") + ".")
        + Символы.ПС + "Провести документ?";

    Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
    Если Ответ <> КодВозвратаДиалога.Да Тогда
        Отказ = Истина; // запись отменена, документ остался непроведённым
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоказаниеПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Показания.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
	   Возврат;
	КонецЕсли;
	Результат = ПересчитатьСтрокуНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
	Если ЗначениеЗаполнено(Результат.Сообщение) Тогда
	    ПоказатьПредупреждение(, Результат.Сообщение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПересчитатьСтрокуНаСервере(ИдентификаторСтроки)
	Результат = Новый Структура("Сообщение", "");
	Стр = Объект.Показания.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Стр = Неопределено Или Стр.Счетчик.Пустая() Тогда
	   Возврат Результат;	
   КонецЕсли; 
   Если Не ЗначениеЗаполнено(Стр.ПредыдущееПоказание) Тогда
       Стр.ПредыдущееПоказание = ЭлектроУчет.ТекущееПоказаниеЧисло(Стр.Счетчик, Объект.Дата - 1);   
   КонецЕсли;
   Расчет = ЭлектроУчет.ДельтаПоказаний(Стр.Счетчик, Стр.ПредыдущееПоказание, Стр.Показание);
   Если Расчет.Успех Тогда
      Стр.ПотреблениеКвт = Расчет.Дельта;
  Иначе
	  Стр.ПотреблениеКвт = 0;
	  Результат.Сообщение = "Счётчик " + Строка(Стр.Счетчик) + ": " + Расчет.Сообщение;   
  КонецЕсли;
  Возврат Результат;
КонецФункции
